maxime-a/STM32WB-EmulatedUART/Middlewares/STM32_UART_EMUl_Library/Src/stm32wbxx_hal_uart_emul.c
/**
 * *****************************************************************************
 * @file	stm32wbxx_hal_uart_emul.c
 * @author	Maxime A
 * @brief	UART Emulation driver
 * @note	Original ST header and copyright below. Peripheral config, handlers adapted
 * 			and buffer declaration fixed from original F4 driver.
 * *****************************************************************************
 */

/**
  ******************************************************************************
  * @author  MCD Application Team
  * @version V1.0.0
  * @date    19-March-2015
  * @brief   UART Emulation HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the Universal Asynchronous Receiver Transmitter (UART Emulation):
  *           + Initialization and de-initialization functions
  *           + IO operation functions
  *           + Peripheral State and Errors functions
  *
  @verbatim
   ==============================================================================
                        ##### How to use this driver #####
   ==============================================================================
  [..]
    The UART Emulation HAL driver can be used as follows:

    (#) Declare a UART_Emul_HandleTypeDef handle structure.

    (#) Initialize the UART Emulation low level resources by implementing the HAL_UART_Emul_MspInit() API:
        (##) Enable the UART_EMUL clock
        (##) UART Emulation port declaration
            (+++) UART pins configuration: TxPinNumber and RxPinNumber
            (+++) Enable the clock for the GPIOs

    (#) Program the Baud Rate, Word Length, Stop Bit, Parity,
         and Mode(Receiver/Transmitter) in the huart Emul Init structure.

    (#) Initialize the UART Emulation registers software by calling the HAL_UART_Emul_Init() API.

        -@- The specific UART Emulaion Handle (Transmission complete, Reception complete
            and Transfer Error) will be managed using the macros HAL_UART_Emul_TxCpltCallback(),
						HAL_UART_Emul_RxCpltCallback() and __HAL_UART_Emul_TranferError() inside the transmit
            and receive process.

        -@- These API's(HAL_UART_Emul_Init() configures also the low level Hardware GPIO, CLOCK, CORTEX...etc)
     				by calling the customed HAL_UART_Emul_MspInit() API.

    (#) Three modes of operations are available within this driver:

     *** UART Emulation mode IO operation ***
     ===================================
     [..]
       (+) Send an amount of data in non blocking mode (DMA) using HAL_UART_Emul_Transmit_DMA()
       (+) At transmission end of transfer HAL_UART_Emul_TxCpltCallback is executed and user can
            add his own code by customization of function pointer HAL_UART_Emul_TxCpltCallback
       (+) Receive an amount of data in non blocking mode (DMA) using HAL_UART_Emul_Receive_DMA()

       (+) At reception end of transfer HAL_UART_Emul_RxCpltCallback is executed and user can
            add his own code by customization of function pointer HAL_UART_Emul_RxCpltCallback
       (+) In case of transfer Error, HAL_UART_ErrorCallback() function is executed and user can
            add his own code by customization of function pointer HAL_UART_Emul_ErrorCallback

     *** UART Emulation HAL driver macros list ***
     =============================================
     [..]
       Below the list of most used macros in UART Emulation HAL driver.

      (+) __HAL_UART_EMUL_GET_FLAG : Checks whether the specified UART Emulation flag is set or not
      (+) __HAL_UART_EMUL_CLEAR_FLAG : Clears the specified UART Emulation pending flag
      (+) __HAL_UART_EMUL_SET_FLAG : Set the specified UART Emulation flag

     [..]
       (@) You can refer to the UART Emulation HAL driver header file for more useful macros

  @endverbatim
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2015 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32wbxx_hal.h"
#include "stm32wbxx_hal_uart_emul.h"
#define HAL_UART_EMUL_MODULE_ENABLED
/** @addtogroup STM32F4xx_HAL_Driver
  * @{
  */

/** @defgroup UART_EMUL_HAL_Driver
  * @brief HAL UART Emulation module driver
  * @{
 */
#ifdef HAL_UART_EMUL_MODULE_ENABLED

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* DMA Handle declaration */
static DMA_HandleTypeDef  hdma_tx;
static DMA_HandleTypeDef  hdma_rx;
/* Timer handler declaration */
static TIM_HandleTypeDef  TimHandle;

/* UART Emulation Handle */
static UART_Emul_HandleTypeDef      *huart_emul;

/* First Buffer for format data in reception mode */
static uint32_t pFirstBuffer_Rx[RX_BUFFER_SIZE];

/* Second Buffer for format data in reception mode */
static uint32_t pSecondBuffer_Rx[RX_BUFFER_SIZE];

/* First Buffer for format data in transmission mode */
static uint32_t pFirstBuffer_Tx[TX_BUFFER_SIZE];

/* Second Buffer for format data in transmission mode */
static uint32_t pSecondBuffer_Tx[TX_BUFFER_SIZE];

