maxime-a/STM32WB-EmulatedUART/Middlewares/STM32_UART_EMUl_Library/Src/stm32wbxx_hal_uart_emul.c
/* Private function prototypes -----------------------------------------------*/
static void UART_Emul_SetConfig (UART_Emul_HandleTypeDef *huart);
static void UART_Emul_SetConfig_DMATx(void);
static void UART_Emul_SetConfig_DMARx(void);
static void UART_Emul_DMATransmitCplt(DMA_HandleTypeDef *hdma);
static void UART_Emul_DMAReceiveCplt(DMA_HandleTypeDef *hdma);
static void UART_Emul_DMAError(DMA_HandleTypeDef *hdma);
static void UART_Emul_TransmitFrame(UART_Emul_HandleTypeDef *huart);
static void UART_Emul_ReceiveFrame(UART_Emul_HandleTypeDef *huart, uint32_t *pData);
static void UART_Emul_TransmitFormatFrame(UART_Emul_HandleTypeDef *huart , uint8_t pData, uint32_t *pBuffer_Tx);
static uint8_t UART_Emul_ReceiveFormatFrame(UART_Emul_HandleTypeDef *huart, uint32_t *pBuffer, uint8_t pFrame);


/* Private functions ---------------------------------------------------------*/


/** @defgroup UART_Private_Functions
  * @{
  */

/** @defgroup UART_Emulation_Group1 Initialization and de-initialization functions
  *  @brief    Initialization and Configuration functions
  *
@verbatim
 ===============================================================================
            ##### Initialization and Configuration functions #####
 ===============================================================================
    This subsection provides a set of functions allowing to initialize the UART Emulation
    in asynchronous mode.
      (+) For the asynchronous mode only these parameters can be configured:
        (++) Baud Rate (4800 up 115200)
        (++) Word Length (5 bit up 9 bit)
        (++) Stop Bit (1 or 2 stop bit)
        (++) Parity: If the parity is enabled, then the MSB bit of the data to be transmitted
              				is changed by the parity bit.

@endverbatim
  * @{
  */

/**
  * @brief  Initializes the UART Emulation mode according to the specified parameters in
  *         the UART_Emul_InitTypeDef and create the associated handle.
  * @param  huart: UART Emulation handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_UART_Emul_Init(UART_Emul_HandleTypeDef *huart)
{
  /* Check the UART handle allocation */
  if (huart == NULL)
  {
    return HAL_ERROR;
  }

  if (huart->State == HAL_UART_EMUL_STATE_RESET)
  {
    /* Init the low level hardware : GPIO, CLOCK */
    HAL_UART_Emul_MspInit(huart);
  }

  /* Get Structure for uart emul Handle */
  huart_emul = huart;

  /* Set the TIM state */
  huart->State = HAL_UART_EMUL_STATE_BUSY;

  /* Set the UART Emulation Communication parameters */
  UART_Emul_SetConfig(huart);

  /* Initialize the UART Emulation state */
  huart->ErrorCode = HAL_UART_EMUL_ERROR_NONE;
  huart->State = HAL_UART_EMUL_STATE_READY;

  return HAL_OK;
}

/**
  * @brief  DeInitializes the UART Emulation .
  * @param  huart: UART Emulation handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_UART_Emul_DeInit(UART_Emul_HandleTypeDef *huart)
{
  /* Check the UART Emulation handle allocation */
  if (huart == NULL)
  {
    return HAL_ERROR;
  }

  huart->State = HAL_UART_EMUL_STATE_BUSY;

  /* DeInit the low level hardware */
  HAL_UART_Emul_MspDeInit(huart);

  huart->ErrorCode = HAL_UART_EMUL_ERROR_NONE;
  huart->State = HAL_UART_EMUL_STATE_RESET;

  return HAL_OK;
}

/**
  * @brief  Initializes the UART Emulation MSP.
  * @param  huart: UART Emulation Handle
  * @retval None
  */
__weak void HAL_UART_Emul_MspInit(UART_Emul_HandleTypeDef *huart)
{
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_UART_Emul_MspInit could be implemented in the user file
   */
}

/**
 * @brief  UART Emulation MSP DeInit.
 * @param  huart: UART Emulation handle
 * @retval None
 */
__weak void HAL_UART_Emul_MspDeInit(UART_Emul_HandleTypeDef *huart)
{
  /* NOTE: This function Should not be modified, when the callback is needed,
           the HAL_UART_Emul_MspDeInit could be implemented in the user file
   */
}

/**
  * @}
  */

/** @defgroup UART_Emulation_Group2 IO operation functions
  *  @brief UART Emulation Transmit and Receive functions
  *
@verbatim
  ==============================================================================
                      ##### IO operation functions #####
  ==============================================================================
   This subsection provides a set of functions allowing to manage the UART asynchronous
   and Half duplex data transfers.

    (#) There is one mode of transfer:
       (++) Non-Blocking mode: The communication is performed using DMA,
            this APIs returns the HAL status.
            The end of the data processing will be indicated through the
            DMA IRQ

            The HAL_UART_Emul_TxCpltCallback(), HAL_UART_Emul_RxCpltCallback() user callbacks
            will be executed respectivelly at the end of the transmit or receive process.
            The HAL_UART_Emul_ErrorCallback() user callback will be executed when
            a communication error is detected.

    (#) Non Blocking mode functions with DMA are:
        (++) HAL_UART_Emul_Transmit_DMA()
        (++) HAL_UART_Emul_Receive_DMA()

    (#) A set of Transfer Complete Callbacks are provided in Non Blocking mode:
        (++) HAL_UART_Emul_TxCpltCallback()
        (++) HAL_UART_Emul_RxCpltCallback()
        (++) HAL_UART_Emul_ErrorCallback()

    [..]

@endverbatim
  * @{
  */
/**
 * @brief  Sends an amount of data
 * @param  huart: UART Emulation handle
 * @param  pData: Pointer to data buffer
 * @param  Size: Amount of data to be sent
 * @retval HAL status
*/
HAL_StatusTypeDef HAL_UART_Emul_Transmit_DMA(UART_Emul_HandleTypeDef *huart, uint8_t *pData, uint16_t Size)
{
  uint32_t tmp = 0;

  tmp = huart->State;
  if ((tmp == HAL_UART_EMUL_STATE_READY) || (tmp == HAL_UART_EMUL_STATE_BUSY_RX))
  {
    if ((pData == NULL ) || (Size == 0))
    {
      return HAL_ERROR;
    }

    huart->TxXferSize = Size;
    huart->pTxBuffPtr = pData;
    huart->TxXferCount = 1;
    huart->ErrorCode = HAL_UART_EMUL_ERROR_NONE;

    /* Check if a receive process is ongoing or not */
    if (huart->State == HAL_UART_EMUL_STATE_BUSY_RX)
    {
      huart->State = HAL_UART_EMUL_STATE_BUSY_TX_RX;
    }
    else
    {
      huart->State = HAL_UART_EMUL_STATE_BUSY_TX;
    }

