maxime-a/STM32WB-EmulatedUART/Middlewares/STM32_UART_EMUl_Library/Src/stm32wbxx_hal_uart_emul.c
  /* Set hdma_tim instance */
  hdma_tx.Instance = DMA1_Channel1;

  //hdma_tx.Parent = TimHandle.hdma[1];
  /* Link hdma_tim to hdma[ ] ( channel Tx or Rx) */
  __HAL_LINKDMA(&TimHandle, hdma[1] , hdma_tx);

  /* Initialize TIMx DMA handle */
  HAL_DMA_Init(TimHandle.hdma[1]);

  /*##-2- NVIC configuration for DMA transfer complete interrupt ###########*/
  HAL_NVIC_SetPriority(DMA1_Channel1_IRQn, 3, 3);
  HAL_NVIC_EnableIRQ(DMA1_Channel1_IRQn);
}

/**
  * @brief  Configures the DMA for UART Emulation reception.
             + DMA2 Configuration channel, Stream, Mode, ...
  * @param  None
  * @retval None
  */
static void UART_Emul_SetConfig_DMARx(void)
{
  /*##-1- Configure  DMA For UART Emulation RX #############################*/
  /* Set the parameters to be configured */
  hdma_rx.Init.Request             = DMA_REQUEST_TIM1_CH2;         /* DMA request triggered from TIM1_CH2  */
  hdma_rx.Init.Direction           = DMA_PERIPH_TO_MEMORY;         /* Transfer mode                        */
  hdma_rx.Init.PeriphInc           = DMA_PINC_DISABLE;             /* Peripheral increment mode Disable    */
  hdma_rx.Init.MemInc              = DMA_MINC_ENABLE;              /* Memory increment mode Enable         */
  hdma_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;          /* Peripheral data alignment :Word      */
  hdma_rx.Init.MemDataAlignment    = DMA_MDATAALIGN_WORD;          /* memory data alignment : Word         */
  hdma_rx.Init.Mode                = DMA_NORMAL;                   /* Normal DMA mode                      */
  hdma_rx.Init.Priority            = DMA_PRIORITY_VERY_HIGH;       /* priority level : very high           */

  /* Set hdma_tim instance */
  hdma_rx.Instance = DMA1_Channel2;

  /* Link hdma_tim to hdma[ ] ( channel Tx or Rx) */
  __HAL_LINKDMA(&TimHandle, hdma[2], hdma_rx);

  /* Initialize TIMx DMA handle */
  HAL_DMA_Init(TimHandle.hdma[2]);

  /*##-2- NVIC configuration for DMA transfer complete interrupt ###########*/
  HAL_NVIC_SetPriority(DMA1_Channel2_IRQn, 0, 1);
  HAL_NVIC_EnableIRQ(DMA1_Channel2_IRQn);
}

/**
 * @brief  Format Frame in Receiver mode.
 * @param  huart: UART Emulation handle
 * @param  pBuffer: pointer of receiver Buffer
 * @param  pFrame: pointer of Frame
 * @retval None
*/
static uint8_t UART_Emul_ReceiveFormatFrame(UART_Emul_HandleTypeDef *huart, uint32_t *pBuf, uint8_t Data)
{
  uint32_t counter = 0;
  uint32_t length = 0;
  uint32_t tmp = 0;
  uint32_t cntparity = 0;

  if (huart->Init.Parity != UART_EMUL_PARITY_NONE)
  {
    /* Get Length of frame */
    length = huart->Init.WordLength -1 ;
  }
  else
  {
    /* Get Length of frame */
    length = huart->Init.WordLength ;
  }

  if ((pBuf[huart->Init.WordLength+1]&huart->Init.RxPinNumber) != huart->Init.RxPinNumber)
  {
    /* UART Emulation frame error occurred */
    __HAL_UART_EMUL_SET_FLAG(huart_emul, UART_EMUL_FLAG_FE);

    huart->ErrorCode |= HAL_UART_EMUL_ERROR_FE;

    /* Disable External interrupt for next Frame */
    EXTI->IMR1 &= ~EXTI_EMR1_EM3;

    /* Handle for UART Emulation Error */
    HAL_UART_Emul_ErrorCallback(huart);

    tmp = RESET;
  }
  else
  {
    /* format data */
    for (counter = 0; counter < length; counter++)
    {
      if ((pBuf[counter+1]&(huart->Init.RxPinNumber)) == (huart->Init.RxPinNumber))
      {
        Data = (0x01 << counter) | Data;
        cntparity ++;
      }
    }
    /* Parity Bit */
    if (huart->Init.Parity == UART_EMUL_PARITY_ODD)
    {

      if (((cntparity % 2) != SET) && ((pBuf[length+1]&huart->Init.RxPinNumber) != huart->Init.RxPinNumber))
      {
        /* Set flag PE */
        __HAL_UART_EMUL_SET_FLAG(huart, UART_EMUL_FLAG_PE);

        HAL_UART_Emul_ErrorCallback(huart);
      }
    }
    if (huart->Init.Parity == UART_EMUL_PARITY_EVEN)
    {

      if (((cntparity % 2) != RESET) && ((pBuf[length+1]&huart->Init.RxPinNumber) != huart->Init.RxPinNumber))
      {
        /* UART Emulation parity error occurred */
        __HAL_UART_EMUL_SET_FLAG(huart, UART_EMUL_FLAG_PE);

        huart->ErrorCode |= HAL_UART_EMUL_ERROR_PE;

        HAL_UART_Emul_ErrorCallback(huart);
      }
    }

    /* Reset counter parity */
    cntparity = 0;

    tmp = Data;
  }

  return tmp;
}
/**
  * @brief  This function formats one Frame
  * @param  UART Emulation Handle
  * @param  pdata pinteur in data
  * @retval None
  */
static void UART_Emul_TransmitFormatFrame(UART_Emul_HandleTypeDef *huart , uint8_t Data, uint32_t *pBuffer_Tx)
{
uint32_t counter = 0;
uint32_t bitmask = 0;
uint32_t length = 0;
uint32_t cntparity = 0;


  length = huart->Init.WordLength;

  /* Get the Pin Number */
  bitmask = (uint32_t)huart->Init.TxPinNumber;

/* with no parity */
if(huart->Init.Parity == 0x00)
{
  for (counter = 0; counter < length; counter++)
  {
    if (((Data >> counter)&BitMask) != 0)
    {
      pBuffer_Tx[counter+1] = bitmask;
    }
    else
    {
      pBuffer_Tx[counter+1] = (bitmask << 16);
    }
  }
}
/* with parity */
else
{
  for (counter = 0; counter < length-1; counter++)
  {
    if (((Data >> counter)&BitMask) != 0)
    {
      pBuffer_Tx[counter+1] = bitmask;
      cntparity ++;
    }
    else
    {
      pBuffer_Tx[counter+1] = (bitmask << 16);
    }
  }
}

  switch  (huart->Init.Parity)
  {
    case UART_EMUL_PARITY_ODD:
    {
      /* Initialize Parity Bit */
      if ((cntparity % 2) != SET)
      {
        pBuffer_Tx[length] = bitmask;
      }
      else
      {
        pBuffer_Tx[length] = (bitmask << 16);
      }

    }
    break;
    case UART_EMUL_PARITY_EVEN:
    {
      /* Initialize Parity Bit */
      if ((cntparity % 2) != SET)
      {
        pBuffer_Tx[length] = (bitmask << 16);
      }
      else
      {
        pBuffer_Tx[length] = bitmask;
      }
    }
    break;
    default:
      break;
  }
  /* Initialize Bit Start */
  pBuffer_Tx[0] = (bitmask << 16);

  if (huart->Init.StopBits == UART_EMUL_STOPBITS_1)
  {
    /* Initialize Bit Stop  */
    pBuffer_Tx[length+1] = bitmask;
  }
  else
  {
    /* Initialize Bit Stop  */
    pBuffer_Tx[length+1] = bitmask;
    pBuffer_Tx[length+2] = bitmask;
  }
  /* Reset counter parity */
  cntparity = 0;
}

/**
  * @brief  Sends an amount of Frames
  * @param  huart: UART Emulation handle
  * @param  pData: Frame to be sent
  * @retval None
  */
static void UART_Emul_TransmitFrame(UART_Emul_HandleTypeDef *huart)
{
  uint32_t tmp_sr = 0;
  uint32_t tmp_ds = 0;
  uint32_t tmp_size = 0;


  if ((huart_emul->TxXferCount % 2 ) != 0)
  {
    tmp_sr = (uint32_t)pFirstBuffer_Tx;
  }
  else
  {
    tmp_sr = (uint32_t)pSecondBuffer_Tx;
  }

  tmp_ds = (uint32_t) & ((huart->TxPortName)->BSRR);

  tmp_size = __HAL_UART_EMUL_FRAME_LENGTH(huart);

  /* Enable the Peripheral */
  __HAL_DMA_DISABLE(&hdma_tx);

  /* Configure DMA Stream data length */
  hdma_tx.Instance->CNDTR = tmp_size;

  /* Configure DMA Stream destination address */
  hdma_tx.Instance->CPAR = tmp_ds;

